docs/inclass05B.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 21:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 5B</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 5B</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcd2c3dc">1. Instructions</a></li>
<li><a href="#orgc60b1b3">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcd2c3dc" class="outline-2">
<h2 id="orgcd2c3dc"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the following:
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">A</span>:
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> reduce (<span style="color: #ECBE7B;">Reducer</span> <span style="color: #dcaeea;">x</span>)    
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Effects: if x is null throw NPE </span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">else if x is not appropriate for this throw IAE</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">else reduce this by x</span>

        <span style="color: #51afef;">class</span> B:
        <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> reduce (<span style="color: #ECBE7B;">Reducer</span> <span style="color: #dcaeea;">x</span>) 
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Requires: x is not null</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Effects: if x is not appropriate for this throw IAE</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">else reduce this by x</span>

        <span style="color: #51afef;">class</span> C:
        <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> reduce (<span style="color: #ECBE7B;">Reducer</span> <span style="color: #dcaeea;">x</span>)   
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Effects: if x is null return (normally) with no change to this</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">else if x is not appropriate for this throw IAE</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">else reduce this by x</span>
</pre>
</div>

<p>
Analyze the "methods rule" for <code>reduce()</code> in each of these cases: Note: Some analysis may not be necessary. If so, indicate that.
</p>

<div class="org-src-container">
<pre class="src src-text">
B extends A.
Precondition Part:
Postcondition Part:
-----------------------------------          
C extends A.
Precondition Part:
Postcondition Part:
-----------------------------------          
A extends B.
Precondition Part:
Postcondition Part:
-----------------------------------          
C extends B.
Precondition Part:
Postcondition Part:
-----------------------------------                    
A extends C.
Precondition Part:
Postcondition Part: 
-----------------------------------          
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc60b1b3" class="outline-2">
<h2 id="orgc60b1b3"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
